       01  ws-login-biometria-in identified by "data".
           03 identified by "cpfcnpj".
              05 app-bio-cpfcnpj-in       pic x any length.
           03 identified by "deviceId".
              05 app-bio-device-in        pic x any length.
