

      *    Estrutura de solicitacao
       01  ws-verificar-senha-in identified by "". 
           03 identified by "cpfcnpj".
             05 app-ver-senha-cpfcnpj-in            pic x(18).
           03 identified by "senha".
             05 app-ver-senha-senha-in              pic x(10).
           03 identified by "deviceId".
             05 app-ver-senha-device-in             pic x any length.
             
              
                    
                    
                    
                                                